Repository: SaraElwatany/Hilal-A-Skin-Burn-Severity-Assessment-Mobile-Application---Deployed-Version
Catalog: gp_app/lib/l10n/intl_*.arb
Languages: ar

# app_title
source: patient and doctor assistanat
ar: مساعدك الطبى

# title
source: Flutter localization
ar: اللغة العربية

# appName
source: Home Assisstant Doctor
ar: مساعدك المنزلى

source: Welcome !
ar: مرحباً !

# hilal
source: I'm Hilal, Your skin burn care companion.
ar: أنا هلال, رفيق صحتك .

# chooselang
source: First, join to us by creating an account or press emergency if you are in hurry.
ar: أولاً، انضم إلينا عن طريق إنشاء حساب أو اضغط على الطوارئ إذا كنت في عجلة من أمرك.

source: login
ar: سجل دخول

source: Start
ar: ابدأ

source: First Name
ar: الاسم الأول

# lastName
source: Second Name
ar: اسم العائلة

# mail
source: E-mail
ar: بريدك الألكتروني

source: Password
ar: كلمة المرور

# language
source: English
ar: العربية

# home_screen_greeting
source: Welcom to our application
ar: مرحبا بك فى التطبيق الخاص بنا

# nothaveAcc
source: Don't have an account?
ar: لا يوجد لديك حساب؟

# haveAcc
source: Do you have an account?
ar: لديك حساب بالفعل؟

# loginNw
source: login
ar: تسجيل الدخول

# signNw
source: Sign up
ar: اشترك الآن

source: Sign Up
ar: اشتراك

source: Next
ar: التالى

source: Burns
ar: حروق

# upload
source: Upload Image
ar: رفع الصورة

# message
source: Ask Hilal...
ar: اسأل هلال...

source: About
ar: معلومات

# intro
source: Hello! My name is Hilal, the health companion for burn patients. I am here to answer your questions about the treatment and management of skin burns that occur at home.
ar: أهلا, أنا هلال, رفيق الرعاية الصحة لمرضى الحروق. تقدر تسألني اسئلة متعلقة بمعالجة و متابعة حروق الجلد أو إي إصابات شبهها بتحصل في البيت.

# asadmin
source: Admin
ar: مسؤول

source: Confirm
ar: تأكيد

source: Edit
ar: تعديل

# clinictitle
source: Clinical data on burn
ar: معلومات عن الحرق

# symptoms
source: Identify your symptom:
ar: الأعراض التي تعانى منها :

# symptom_1
source: Trembling limbs
ar: اطراف مرتعشة

# symptom_2
source: Diarrhea
ar: اسهال

# symptom_3
source: Cold extremities
ar: برودة الأطراف

# symptom_4
source: Nausea
ar: غثيان

# cause
source: Cause of burn:
ar: سبب الحرق :

# heat
source: Fire/Fire flame
ar: لهب/نار

source: Electricity
ar: كهرباء

source: Chemical
ar: كيميائي

source: Radioactive
ar: إشعاعي

# boiling
source: Boiling Liquid
ar: سائل مغلي

# place
source: Burn Place
ar: مكان الحرق

source: Arm
ar: ذراع

# head
source: Head and Neck
ar: الرأس و العنق

source: Leg
ar: الرجل

# chest
source: Chest and Upper back
ar: الصدر وأعلى الظهر

# back
source: Abdomen and Lower back
ar: البطن وأسفل الظهر

source: Patients
ar: المرضى

source: Time
ar: الوقت

source: Danger
ar: الخطورة

source: Skip
ar: تخطى

source: Select Image
ar: اختر صورة

# aboutUsMessage
source: We are student developers from faculty of biomedical engineering in Cairo University. We created this app to help victims of burn injuries at home find proper resources for managing their injury.
ar: نحن طلاب كلية الهندسة الطبية والمنظومات بجامعه القاهرة. قمنا بإنشاء هذا التطبيق لمساعدة ضحايا الحروق المنزلية على التعامل مع الإصابات فى الوقت المناسب

source: Emergency
ar: طوارئ

source: Doctors
ar: دكاترة

# addDoctors
source: Add Doctor
ar: إضافة طبيب

# doctorInfo
source: Doctor Information
ar: بيانات الطبيب

# degree
source: Professional degree
ar: الدرجة الوظيفية

source: Save
ar: حفظ

source: Instructions
ar: تعليمات

# userlocation
source: Location
ar: سجل موقعك

# location
source: Get current location
ar: الموقع الحالى

# ch
source: Burn History
ar: تاريخ الإصابات

# goodLigthingTitle
source: Good lighting
ar: الإضاءة الجيدة

# goodLigthingtext
source: Make sure there is good lighting when taking the photo. Natural lighting during the day is best. Avoid very strong lighting that may cause harsh glare or shadows
ar: تأكد من وجود إضاءة جيدة عند التقاط الصورة. الإضاءة الطبيعية خلال النهار هي الأفضل. تجنب الإضاءة القوية جدًا التي قد تسبب توهجًا أو ظلالًا شديدة.

# simpleBackgroundTitle
source: Simple background
ar: الخلفية البسيطة

# simpleBackgroundText
source: Use a neutral, non-distracting background. A plain or white background helps highlight the details of the burn.
ar: استخدم خلفية محايدة وغير مشتتة. خلفية بيضاء أو سادة تساعد في إبراز تفاصيل الحرق.

# flashligthTitle
source: Avoid using Flash Ligth
ar: تجنب استخدام الفلاش

# flashligthText
source: Flash may change the colors of the burn and make details blurry. Use natural light as much as possible.
ar: الفلاش قد يغير من ألوان الحرق ويجعل التفاصيل غير واضحة. استخدم الضوء الطبيعي قدر الإمكان.

# burnDetailsTitle
source: Burning Details
ar: تفاصيل الحرق

# burnDetailsText
source: Take pictures from several angles to show all the details of the burn. Close-up photos to show edges, depth, and any discolouration.
ar: التقط الصور من عدة زوايا لإظهار جميع تفاصيل الحرق. صور من مسافة قريبة لتوضيح الحواف والعمق وأي تغير في اللون.

# burnTouchTitle
source: Avoid touching Burn Area
ar: تجنب لمس الحرق

# burnTouchText
source: Do not try to move or touch the burn to improve the view in the image, so as not to aggravate the injury.
ar: لا تحاول تحريك أو لمس الحرق لتحسين الرؤية في الصورة، حتى لا تتسبب في تفاقم الإصابة.

# foucsTitle
source: Focus
ar: التركيز

# foucsText
source: Use the auto focus mode on your camera to make sure the image is clear and not blurry. Check the sharpness of the image before sending it.
ar: استخدم وضع التركيز التلقائي على الكاميرا للتأكد من أن الصورة واضحة وغير ضبابية. تحقق من حدة الصورة قبل إرسالها.

# privacyTitle
source: Respect Privacy
ar: احترام الخصوصية

# privacyText
source: Make sure that no personal features or any sensitive information is visible in the photo.
ar: تأكد من عدم ظهور معالم شخصية أو أي معلومات حساسة في الصورة

# areadetection
source: Determine size
ar: تحديد الحجم

# areadetectionText
source: If the burn is large, you may need to take several pictures from different distances to show the actual size of the burn in relation to other parts of the body.
ar: إذا كان الحرق كبير، قد تحتاج إلى التقاط عدة صور من مسافات مختلفة لتوضيح الحجم الفعلي للحرق بالنسبة لأجزاء الجسم الأخرى.

# firstDegreeMessage
source: Your Burn Degree is First Degree Burn.The Following First Aid Protocols are Recommended: 1.Make sure that you are away from the source of burn. 2.Douse the area with room temperature tap water. 3.DO NOT USE ICE, BUTTER, TOOTHPASTE, OR OTHER CHEMICALS. 4.Take off any accessories (Jewelry, watches, rings, etc.) 5.Apply Mebo or Dermazine to the burned area, then cover it with a sterile bandage or a clean cloth. 6.Seek Medical attention if: i. If the burned area is larger than the size of your palm, seek medical attention. ii. Burns on the face, hands, feet, genitals, or major joints. iii. Chemical burns, Electrical burns. iv. For any burns that cause severe pain, blistering, or white or charred skin.
ar: الحرق من الدرجة الأولى. الإسعافات الأولية الموصى بها: 1. اتأكد من أنك بعيد عن مصدر الحرق. 2. اغسل مكان الحرق بمياه حنفية في درجة حرارة الغرفة لمدة ١٠-١٥ دقايق عشان تبرد الجلد. متستخدمش الثلج أو زبدة أو معجون أسنان أو أي مواد كيميائية تانية. 3. اخلع أي إكسسوارات (مثل المجوهرات أو الساعات أو الخواتم). 4. ادهن مرهم ميبو أو درمازين على المنطقة المحروقة بعدين غطيها بشاش و بلاستر أو قطعة قماش نظيفة. 5.اطلب المساعدة الطبية إذا: - كانت المنطقة المحترقة أكبر من حجم راحة يدك. - الحروق على الوجه أو اليدين أو القدمين أو المناطق الحساسة أو المفاصل الكبيرة. - الحروق الكيميائية أو الكهربائية. - الحروق التي تسبب ألمًا شديدًا أو ظهور فقاعات أو جلد أبيض أو محترق.

# secondDegreeMessage
source: Your Burn Degree is Second Degree Burn. The Following First Aid Protocols are Recommended: 1.Make sure that you are away from the source of burn. 2.Douse the area with room temperature tap water. 3.DO NOT USE ICE, BUTTER, TOOTHPASTE, OR OTHER CHEMICALS. 4.Take off any accessories (Jewelry, watches, rings, etc.) 5.Apply Mebo or Dermazine to the burned area, then cover it with a sterile bandage or a clean cloth. 6.Seek Immediate medical attention.
ar: الحرق من الدرجة الثانية. الإسعافات الأولية الموصى بها: 1. اتأكد من أنك بعيد عن مصدر الحرق. 2. اغسل مكان الحرق بمياه حنفية في درجة حرارة الغرفة لمدة ١٠-١٥ دقايق عشان تبرد الجلد. متستخدمش الثلج أو زبدة أو معجون أسنان أو أي مواد كيميائية تانية. 3. اخلع أي إكسسوارات (مثل المجوهرات أو الساعات أو الخواتم). 4. ادهن مرهم ميبو أو درمازين على المنطقة المحروقة بعدين غطيها بشاش و بلاستر أو قطعة قماش نظيفة. 5. روح المستشفى علي طول.

# thirdDegreeMessage
source: Your Burn Degree is Third Degree Burn. The Following First Aid Protocols are Recommended: 1.Make sure that you are away from the source of burn. 2.Douse the area with room temperature tap water. 3.DO NOT USE ICE, BUTTER, TOOTHPASTE, OR OTHER CHEMICALS. 4.Take off any accessories (Jewelry, watches, rings, etc.) 5.Apply Mebo or Dermazine to the burned area, then cover it with a sterile bandage or a clean cloth. 6.Seek Immediate medical attention.
ar: الحرق من الدرجة الثالثة. الإسعافات الأولية الموصى بها: 1. اتأكد من أنك بعيد عن مصدر الحرق. 2. اغسل مكان الحرق بمياه حنفية في درجة حرارة الغرفة لمدة ١٠-١٥ دقايق عشان تبرد الجلد. متستخدمش الثلج أو زبدة أو معجون أسنان أو أي مواد كيميائية تانية. 3. اخلع أي إكسسوارات (مثل المجوهرات أو الساعات أو الخواتم). 4. ادهن مرهم ميبو أو درمازين على المنطقة المحروقة بعدين غطيها بشاش و بلاستر أو قطعة قماش نظيفة. 5. روح المستشفى علي طول.

# locationMessage
source: The Following is a List of The Nearest Five Burn Hospitals According to your Location:
ar: المعروض هو قايمة بأقرب خمس مستشفيات حسب المكان الانت متواجد فيه:

# waitingMessage
source: Our Doctors will get to you shortly.
ar: دكاترتنا هيتواصلوا معاك علي طول

# viewMaps
source: View on Maps
ar: عرض علي الخرائط
